n5/src/Catalogs/Functions/Functions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Functions</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Authentication</name>
    <type>
      <types>EnumRef.Authentication</types>
    </type>
  </attributes>
  <attributes>
    <name>Endpoint</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Arguments</name>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Mandatory</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ParameterTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Default</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Examples</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Values</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Constant</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Catalogs/Functions/Forms/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		fillNew ();
	endif; 
	StandardButtons.Arrange ( ThisObject );
	
EndProcedure

&AtServer
Procedure fillNew ()

	if ( Logins.Sysadmin () ) then
		Object.Tenant = undefined;
	else
		Object.Tenant = SessionParameters.Tenant;
	endif;
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure DescriptionOnChange ( Item )

	applyDescription ();

EndProcedure

&AtClient
Procedure applyDescription ()
	
	Object.FullDescription = Object.Description;
	
EndProcedure
